Revit 2024 API
FilterableValueProvider.GetStringValue Method
 Gets a string value from the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public string GetStringValue(
	Element element
)
Visual Basic
Public Function GetStringValue ( _
	element As Element _
) As String
Visual C++
public:
String^ GetStringValue(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The element to query.
Return Value
 The string value from the element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilterableValueProvider Class
Autodesk.Revit.DB Namespace